Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    /*Free CAP Connection Slot*/
    p_conn->Acl_Conn_Handle = 0xFFFFu;
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_NONE;
    p_conn->LinkupRetry = 0;
    p_conn->ConfirmIndicationRequired = 0u;
    p_conn->ForceCompleteLinkup = 0u;
    p_conn->CurrentContentCtrlOp = 0x0000;
    p_conn->PendingContentCtrlOp = 0x0000;
    TMAPAPP_Context.NumConn--;

    /* Stop Sink if device was connected to Broadcast Assistant */
    TMAPAPP_StopSink();

#if (APP_NUM_SRC_ASE > 0u)
    for ( i = 0; i < APP_NUM_SRC_ASE;i++)
    {
      if (p_conn->pASEs->aSrcASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSrcASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          src_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSrcASE[i],
                                                               p_conn->pASEs->aSrcASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSrcASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSrcASE[i].ID = 0x00;
        p_conn->pASEs->aSrcASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSrcASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSrcASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSrcASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SRC_ASE > 0u)*/

    p_conn->pASEs->acl_conn_handle = 0xFFFFu;
    p_conn->pASEs = 0;
    p_conn->AvailableSnkAudioContext = 0x0000u;
    p_conn->AvailableSrcAudioContext = 0x0000u;

    /* if context are now available, update them */
    if ((snk_context != 0x0000) || (src_context != 0x0000) )
    {
      uint8_t enable_ongoing = 0u;
      APP_ACL_Conn_t *p_other_conn;

      TMAPAPP_Context.AvailableSnkAudioContext |= snk_context;
      TMAPAPP_Context.AvailableSrcAudioContext |= src_context;

      /* Check if all supported audio contexts are now available and so AUDIO_CONTEXT_UNSPECIFIED should be also
       * set as available.
       */
      if (snk_context != 0x0000)
      {
        /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
        if ( (TMAPAPP_Context.AvailableSnkAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SNK_CONTEXTS)
        {
          TMAPAPP_Context.AvailableSnkAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
        }
      }
      if (src_context != 0x0000)
      {
        /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
        if ( (TMAPAPP_Context.AvailableSrcAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SRC_CONTEXTS)
        {
          TMAPAPP_Context.AvailableSrcAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
        }
      }

      status = CAP_SetAvailableAudioContexts(TMAPAPP_Context.AvailableSnkAudioContext,
                                             TMAPAPP_Context.AvailableSrcAudioContext);
      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                     TMAPAPP_Context.AvailableSnkAudioContext,
                     TMAPAPP_Context.AvailableSrcAudioContext);
      }
      else
      {
        LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                     TMAPAPP_Context.AvailableSnkAudioContext,
                     TMAPAPP_Context.AvailableSrcAudioContext);
      }
      /*check if a response to an Enable operation Request is suspended with another CAP Initiator*/
      for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
      {
        if ((TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&TMAPAPP_Context.ACL_Conn[conn] != p_conn))
        {
          p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SRC_ASE > 0u)
          for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
          {
            if (p_other_conn->pASEs->aSrcASE[i].allocated == 1)
            {
              if (p_other_conn->pASEs->aSrcASE[i].enable_req == 1)
              {
                enable_ongoing = 1u;
                /* Send an response to the Enable Operation request if no CIS is still up*/
                if (TMAPAPP_Context.num_cis_established == 0u)
                {
                  status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                p_other_conn->pASEs->aSrcASE[i].ID,
                                ASE_OP_RESP_SUCCESS,
                                ASE_OP_RESP_NO_REASON);
                  if (status != BLE_STATUS_SUCCESS)
                  {
                    LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                 status,
                                 p_other_conn->pASEs->aSrcASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                  else
                  {
                    LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                 p_other_conn->pASEs->aSrcASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                }
              }
            }
          }
#endif /* (APP_NUM_SRC_ASE > 0u) */
        }
      }
      /* Check if no response to an Enable Request is in progress to update Audio Contexts availability to
      * the connected CAP Initiators.
      */
      if (enable_ongoing == 0u)
      {
        for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
        {
          if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
          {
            p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
            if ((p_other_conn->AvailableSnkAudioContext != TMAPAPP_Context.AvailableSnkAudioContext) \
                || (p_other_conn->AvailableSrcAudioContext != TMAPAPP_Context.AvailableSrcAudioContext))
            {
              /*update the available Audio Contexts of the all the connected CAP Initiators*/
              status = CAP_UpdateAvailableAudioContexts(p_other_conn->Acl_Conn_Handle,
                                                        TMAPAPP_Context.AvailableSnkAudioContext,
                                                        TMAPAPP_Context.AvailableSrcAudioContext);
              LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                           TMAPAPP_Context.AvailableSnkAudioContext,
                           TMAPAPP_Context.AvailableSrcAudioContext,
                           p_other_conn->Acl_Conn_Handle,
                           status);
              p_other_conn->AvailableSnkAudioContext = TMAPAPP_Context.AvailableSnkAudioContext;
              p_other_conn->AvailableSrcAudioContext = TMAPAPP_Context.AvailableSrcAudioContext;
              UNUSED(status);
            }
            else
            {
              LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                           TMAPAPP_Context.AvailableSnkAudioContext,
                           TMAPAPP_Context.AvailableSrcAudioContext,
                           p_other_conn->Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* Check if the disconnection is issued to a local User action*/
    if (Reason != HCI_CONNECTION_TERMINATED_BY_LOCAL_HOST_ERR_CODE)
    {
      uint8_t enable_solicitation_request = 0;
      if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
      {
        enable_solicitation_request = 1;
      }

