Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      TMAPAPP_StopAdvertising();
      /* Start Advertising */
      if (TMAPAPP_Context.CSIPRank > 0)
      {
        status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_EARBUD);
      }
      else
      {
        status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_HEADPHONES);
      }
      LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
    }
    else
    {
      TMAPAPP_StopAdvertising();
    }
    UNUSED(status);
  }
  else
  {
    /* Check if the Connection Handle corresponds to a CIS link */
    for (uint8_t i = 0; i< APP_MAX_NUM_CIS; i++)
    {
      if (TMAPAPP_Context.cis_handle[i] == Conn_Handle)
      {
        TMAPAPP_Context.cis_handle[i] = 0xFFFFu;
        TMAPAPP_Context.num_cis_established--;
        if (TMAPAPP_Context.num_cis_established == 0u)
        {
          LOG_INFO_APP("Deinitialized Audio Peripherals\n");
          MX_AudioDeInit();
          /*check if a response to an Enable operation Request is suspended with another CAP Initiator*/
          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
            {
              p_conn = &TMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SRC_ASE > 0u)
              for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
              {
                if (p_conn->pASEs->aSrcASE[i].allocated == 1)
                {
                  if (p_conn->pASEs->aSrcASE[i].enable_req == 1)
                  {
                    status = CAP_Unicast_EnableOpRsp(p_conn->Acl_Conn_Handle,
                                  p_conn->pASEs->aSrcASE[i].ID,
                                  ASE_OP_RESP_SUCCESS,
                                  ASE_OP_RESP_NO_REASON);
                    LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                status,
                                p_conn->pASEs->aSrcASE[i].ID,
                                p_conn->Acl_Conn_Handle);
                  }
                }
              }
#endif /* (APP_NUM_SRC_ASE > 0u) */
            }
          }
        }
        break;
      }
    }
  }
}

uint8_t TMAPAPP_SyncToPA(uint8_t AdvSID, uint8_t *pAdvAddress, uint8_t AdvAddressType)
{
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
}

uint8_t TMAPAPP_StartSink(void)
{
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
}

uint8_t TMAPAPP_StopSink(void)
{
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
}

void TMAPAPP_SetBroadcastMode(APP_BroadcastMode_t mode)
{
  TMAPAPP_Context.BroadcastMode = mode;
}

void TMAPAPP_ClearDatabase(void)
{
  BLE_AUDIO_STACK_DB_ClearAllRecords();
}
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

static tBleStatus CAPAPP_Init(Audio_Role_t AudioRole, uint8_t csip_config_id)
{
  tBleStatus status;
  Audio_Role_t audio_role = 0;
  Audio_Context_t available_snk_context = 0;
  Audio_Context_t available_src_context = 0;
  Audio_Context_t supported_snk_context = 0;
  Audio_Context_t supported_src_context = 0;
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
  uint8_t a_snk_cap_id[MIN_NUM_BAP_SNK_CODEC_CAP] = BAP_MANDATORY_SNK_CODEC_CAP_LIST;
  uint8_t num_snk_capabilities = 0;
#endif /*(APP_NUM_SNK_PAC_RECORDS > 0u)*/
#if (APP_NUM_SRC_PAC_RECORDS > 0u)
  uint8_t a_src_cap_id[MIN_NUM_BAP_SRC_CODEC_CAP] = BAP_MANDATORY_SRC_CODEC_CAP_LIST;
  uint8_t num_src_capabilities = 0;
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0u)*/
  Audio_Location_t audio_locations = FRONT_LEFT;

  LOG_INFO_APP("CAPAPP_Init() with audio role 0x%02X\n",AudioRole);

  /*Clear the CAP Configuration*/
  memset(&APP_CAP_Config, 0, sizeof(CAP_Config_t));

  /*Clear the BAP Configuration*/
  memset(&APP_BAP_Config, 0, sizeof(BAP_Config_t));

  /*Clear the MICP Configuration*/
  memset(&APP_MICP_Config, 0, sizeof(MICP_Config_t));

  /*Clear the VCP Configuration*/
  memset(&APP_VCP_Config, 0, sizeof(VCP_Config_t));

  /*Clear the CCP Configuration*/
  memset(&APP_CCP_Config, 0, sizeof(CCP_Config_t));

  /*Clear the MCP Configuration*/
  memset(&APP_MCP_Config, 0, sizeof(MCP_Config_t));

  /*Clear the CSIP Configuration*/
  memset(&APP_CSIP_Config, 0, sizeof(CSIP_Config_t));

  APP_CAP_Config.Role = APP_CAP_ROLE;
  APP_CAP_Config.MaxNumLinks = CFG_BLE_NUM_LINK;
  APP_CAP_Config.pStartRamAddr = (uint8_t *)&aCAPMemBuffer;
  APP_CAP_Config.RamSize = CAP_DYN_ALLOC_SIZE;
#if (APP_BAP_ROLE_UNICAST_SERVER_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_UNICAST_SERVER;
#endif /*(APP_BAP_ROLE_UNICAST_SERVER_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_UNICAST_CLIENT_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_UNICAST_CLIENT;
#endif /*(APP_BAP_ROLE_UNICAST_CLIENT_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_BROADCAST_SOURCE_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_BROADCAST_SOURCE;
#endif /*(APP_BAP_ROLE_BROADCAST_SOURCE_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_BROADCAST_SINK_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_BROADCAST_SINK;
#endif /*(APP_BAP_ROLE_BROADCAST_SINK_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_SCAN_DELEGATOR_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_SCAN_DELEGATOR;
#endif /*(APP_BAP_ROLE_SCAN_DELEGATOR_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_BROADCAST_ASSISTANT_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_BROADCAST_ASSISTANT;
#endif /*(APP_BAP_ROLE_BROADCAST_ASSISTANT_SUPPORT == 1u)*/

  APP_BAP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;
  APP_BAP_Config.MaxNumUSRLinks = MAX_NUM_USR_LINK;

  /*Published Audio Capabilities of Unicast Server and Broadcast Sink Configuration*/
  APP_BAP_Config.PACSSrvConfig.MaxNumSnkPACRecords = APP_NUM_SNK_PAC_RECORDS;
  APP_BAP_Config.PACSSrvConfig.MaxNumSrcPACRecords = APP_NUM_SRC_PAC_RECORDS;
  APP_BAP_Config.PACSSrvConfig.pStartRamAddr = (uint8_t *)&aPACSSrvMemBuffer;
  APP_BAP_Config.PACSSrvConfig.RamSize = BAP_PACS_SRV_DYN_ALLOC_SIZE;

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  if ((APP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR)
  {
    /*Broadcast Audio Scan for Scan Delegator Configuration*/
    APP_BAP_Config.BASSSrvConfig.MaxNumBSRC = MAX_NUM_SDE_BSRC_INFO;
    APP_BAP_Config.BASSSrvConfig.MaxCodecConfSize = MAX_BASS_CODEC_CONFIG_SIZE;
    APP_BAP_Config.BASSSrvConfig.MaxMetadataLength = MAX_BASS_METADATA_SIZE;
    APP_BAP_Config.BASSSrvConfig.MaxNumBaseSubgroups = MAX_NUM_BASS_BASE_SUBGROUPS;
    APP_BAP_Config.BASSSrvConfig.pStartRamAddr = (uint8_t *)&aBASSSrvMemBuffer;
    APP_BAP_Config.BASSSrvConfig.RamSize = BAP_BASS_SRV_DYN_ALLOC_SIZE;
  }

  if (((APP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR)
   || ((APP_BAP_Config.Role & BAP_ROLE_BROADCAST_SINK) == BAP_ROLE_BROADCAST_SINK))
  {
    /* BASE structure for fragmented PA reports */
    APP_BAP_Config.BASEStrConfig.pStartRamAddr = (uint8_t *)&aBASEMemBuffer;
    APP_BAP_Config.BASEStrConfig.RamSize = BAP_BASE_TOTAL_BUFFER_SIZE;
  }
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/

