Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      LOG_INFO_APP("profiles 0x%02X of the GAF are linked on ConnHandle 0x%04x\n",
                    current_link,
                    pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        if ( current_link == 0)
        {
          if (p_conn->LinkupRetry == 0u)
          {
            /*No service has been discovery, we will retry a CAP Linkup in a moment*/
            p_conn->LinkupRetry = 1u;
            UTIL_TIMER_Create(&LinkupRetry_Timer,
                              LINKUP_RETRY_TIMEOUT,
                              UTIL_TIMER_ONESHOT,
                              &LinkupRetry_TimerCallback,
                              0);
            UTIL_TIMER_Start(&LinkupRetry_Timer);
          }
        }
        if (p_conn->LinkupRetry != 1u)
        {
          /*Check if timer should be started to perform a linkup retry with another remote device*/
          for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if ( (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) \
                  && (TMAPAPP_Context.ACL_Conn[conn].LinkupRetry == 1u))
            {
              UTIL_TIMER_Create(&LinkupRetry_Timer,
                                LINKUP_RETRY_TIMEOUT,
                                UTIL_TIMER_ONESHOT,
                                &LinkupRetry_TimerCallback,
                                0);
              UTIL_TIMER_Start(&LinkupRetry_Timer);
              break;
            }
          }
        }
        if (p_conn->ForceCompleteLinkup == 0 || p_conn->CAPLinkupState == APP_CAP_LINKUP_STATE_STARTED_COMPLETE)
        {
          tBleStatus ret;
          if (p_conn->CAPLinkupState == APP_CAP_LINKUP_STATE_STARTED_COMPLETE)
          {
            p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_DONE_COMPLETE;
          }
          else
          {
            p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_DONE_RESTORE;
          }
          /* Check if TMAP is already linked or not*/
          if ((p_conn->AudioProfile & AUDIO_PROFILE_TMAP ) == 0)
          {
            /* Check if TMAP link is present in NVM from a previous connection*/
            if ((TMAP_DB_IsPresent(p_conn->Peer_Address_Type,p_conn->Peer_Address) == 0) \
                || (p_conn->ForceCompleteLinkup == 1u))
            {
              /*Start Complete TMAP link*/
              ret = TMAP_Linkup(pNotification->ConnHandle,TMAP_LINKUP_MODE_COMPLETE);
              LOG_INFO_APP("Complete TMAP Linkup on ConnHandle 0x%04X is started with status 0x%02X\n",
                          pNotification->ConnHandle,
                          ret);
            }
            else
            {
              /* Restore TMAP link*/
              ret = TMAP_Linkup(pNotification->ConnHandle,TMAP_LINKUP_MODE_RESTORE);
              LOG_INFO_APP("Restore TMAP Linkup on ConnHandle 0x%04X returns status 0x%02X\n",
                          pNotification->ConnHandle,
                          ret);
            }
            if (ret == BLE_STATUS_SUCCESS)
            {
              return;
            }
          }
          else if (p_conn->ConfirmIndicationRequired == 1u)
          {
            /* Confirm indication now that the GATT is available */
            ret = aci_gatt_confirm_indication(pNotification->ConnHandle);
            if (ret != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
            }
            else
            {
              LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
            }
            p_conn->ConfirmIndicationRequired = 0u;
          }
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1)
          if ((current_link & MCP_LINK) == MCP_LINK)
          {
            ret = MCP_CLIENT_ConfigureTrackTitleNotification(pNotification->ConnHandle,
                                                             p_conn->GenericMediaPlayerCCID,
                                                             0x01u);
            if (ret != BLE_STATUS_SUCCESS)
            {
              if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
              {
                p_conn->PendingContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
              }
              LOG_INFO_APP("  Fail   : MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           p_conn->GenericMediaPlayerCCID,
                           ret);
            }
            else
            {
              if (p_conn != 0)
              {
                p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
                p_conn->MCPLinkupState = APP_MCP_LINKUP_STATE_CONFIGURE_TRACK_TITLE_NOTIF;
              }
              LOG_INFO_APP("  Success: MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           p_conn->GenericMediaPlayerCCID);
            }
          }
#endif /* (APP_MCP_ROLE_CLIENT_SUPPORT == 1) */

#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1)
          if ((current_link & CCP_LINK) == CCP_LINK)
          {
            ret = CCP_CLIENT_ReadCallState(pNotification->ConnHandle,
                                           p_conn->GenericTelephoneBearerCCID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
              {
                p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
              }
              LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           p_conn->GenericTelephoneBearerCCID,
                           ret);
            }
            else
            {
              if (p_conn != 0)
              {
                p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
              }
              LOG_INFO_APP("  Success: CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           p_conn->GenericTelephoneBearerCCID);
            }
          }
#endif /* (APP_CCP_ROLE_CLIENT_SUPPORT == 1) */
          p_conn->ForceCompleteLinkup = 0;
        }
        else
        {
          tBleStatus ret;

          /* Unlink CAP to perform CAP Complete Linkup */
          CAP_Unlink(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x00);
          ret = CAP_Linkup(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x01);
          LOG_INFO_APP("CAP_Linkup() on ConnHandle 0x%04x for link mask 0x%02X returns status 0x%02X\n",
                      p_conn->Acl_Conn_Handle,
                      MCP_LINK | CCP_LINK,
                      ret);
          UNUSED(ret);
          p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_STARTED_COMPLETE;
        }
      }
      UNUSED(current_link);
      break;
    }

