Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case CAP_UNICAST_AUDIOSTARTED_EVT:
    {
      LOG_INFO_APP("CAP Unicast Start Procedure is Complete with status 0x%02X\n",pNotification->Status);
      break;
    }

    case CAP_UNICAST_AUDIOSTOPPED_EVT:
    {
      LOG_INFO_APP("CAP Unicast Stop Procedure is Complete with status 0x%02X\n",
                  pNotification->Status);
      break;
    }

    case CAP_UNICAST_AUDIO_UPDATED_EVT:
    {
      LOG_INFO_APP("CAP Unicast Update Procedure is Complete with status 0x%02X\n",
                  pNotification->Status);
      break;
    }

    case CAP_UNICAST_SERVER_ASE_STATE_EVT:
    {
      BAP_ASE_State_Params_t *p_info = (BAP_ASE_State_Params_t *)pNotification->pInfo;
      tBleStatus status;
      APP_ASE_Info_t *p_ase = 0;
      uint8_t streaming_ongoing = 0u;
      APP_ACL_Conn_t *p_conn;
      APP_ACL_Conn_t *p_other_conn;
      LOG_INFO_APP("ASE ID %d [Type 0x%02X ] with remote CAP Initiator on ConnHandle 0x%04X is in State 0x%02X\n",
                  p_info->ASE_ID,
                  p_info->Type,
                  pNotification->ConnHandle,
                  p_info->State);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        p_ase = APP_GetASE(p_info->ASE_ID,pNotification->ConnHandle);
        if (p_ase == 0)
        {
          if (p_info->Type == ASE_SINK)
          {
#if (APP_NUM_SNK_ASE > 0u)
            for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
            {
              if (p_conn->pASEs->aSnkASE[i].allocated == 0)
              {
                p_ase = &p_conn->pASEs->aSnkASE[i];
                p_ase->allocated = 1u;
                p_ase->ID = p_info->ASE_ID;
                p_ase->type = p_info->Type;
                p_ase->enable_req = 0u;
                break;
              }
            }
#endif /* (APP_NUM_SNK_ASE > 0u) */
          }
          if (p_info->Type == ASE_SOURCE)
          {
#if (APP_NUM_SRC_ASE > 0u)
            for (uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
            {
              if (p_conn->pASEs->aSrcASE[i].allocated == 0)
              {
                p_ase = &p_conn->pASEs->aSrcASE[i];
                p_ase->allocated = 1u;
                p_ase->ID = p_info->ASE_ID;
                p_ase->type = p_info->Type;
                p_ase->enable_req = 0u;
                break;
              }
            }
#endif /* (APP_NUM_SRC_ASE > 0u) */
          }
        }
        if (p_ase != 0)
        {
          Audio_Context_t snk_context = 0;
          Audio_Context_t src_context = 0;

          /* If ASE State Notification is received, we can consider that potential response to an Enable Operation Request
           * is no more expected by remote CAP Initiator
           */
          p_ase->enable_req = 0u;

          /* ASE was in Enabling/Streaming state but state is no more one of these : streaming is ending*/
          if (((p_ase->state == ASE_STATE_ENABLING) || (p_ase->state == ASE_STATE_STREAMING)) \
            && ((p_info->State != ASE_STATE_ENABLING) && (p_info->State != ASE_STATE_STREAMING)))
          {
            LOG_INFO_APP("ASE ID %d associated to Streaming Audio Contexts 0x%04X is released/Disabled, check if Audio Contexts should be Available now\n",
                         p_ase->ID,
                         p_ase->streaming_audio_context);
            /* Release the Streaming Audio Contexts associated to the ASE to calculate resulting
             * new available audio contexts in compliance with other ASEs in ENABLING or STREAMING state
             */
            if (p_ase->type == ASE_SINK)
            {
              if ( p_ase->streaming_audio_context != 0x0000u)
              {
                snk_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                    p_ase,
                                                                    p_ase->streaming_audio_context);
              }
            }
            else
            {
              if ( p_ase->streaming_audio_context != 0x0000u)
              {
                src_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                    p_ase,
                                                                    p_ase->streaming_audio_context);
              }
            }
            /* reset the Audio Contexts which was associated to the ASE*/
            p_ase->streaming_audio_context = 0x0000u;

            /*update the ASE state*/
            p_ase->state = p_info->State;

            /* Check if potential removed Audio Contexts is also associated to an Enabling/streaming ASE in order to
             * check if it would be available or not*/
#if (APP_NUM_SNK_ASE > 0u)
            for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
            {
              if (p_conn->pASEs->aSnkASE[i].allocated == 1)
              {
                if ((p_conn->pASEs->aSnkASE[i].state == ASE_STATE_ENABLING) \
                  || (p_conn->pASEs->aSnkASE[i].state == ASE_STATE_STREAMING))
                {
                  streaming_ongoing = 1u;
                }
              }
            }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
            for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
            {
              if (p_conn->pASEs->aSrcASE[i].allocated == 1)
              {
                if ((p_conn->pASEs->aSrcASE[i].state == ASE_STATE_ENABLING) \
                  || (p_conn->pASEs->aSrcASE[i].state == ASE_STATE_STREAMING))
                {
                  streaming_ongoing = 1u;
                }
              }
            }
#endif /* (APP_NUM_SRC_ASE > 0u) */
            /* if context are now available, update them */
            if ((snk_context != 0x0000) || (src_context != 0x0000) )
            {
              TMAPAPP_Context.AvailableSnkAudioContext |= snk_context;
              TMAPAPP_Context.AvailableSrcAudioContext |= src_context;
              /* Check if all supported audio contexts are now available and so AUDIO_CONTEXT_UNSPECIFIED should be also
               * set as available.
               */
              if (snk_context != 0x0000)
              {
                /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
                if ( (TMAPAPP_Context.AvailableSnkAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SNK_CONTEXTS)
                {
                  TMAPAPP_Context.AvailableSnkAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
                }
              }
              if (src_context != 0x0000)
              {
                /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
                if ( (TMAPAPP_Context.AvailableSrcAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SRC_CONTEXTS)
                {
                  TMAPAPP_Context.AvailableSrcAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
                }
              }
              /*Set new available audio contexts for BAP Announcement*/
              status = CAP_SetAvailableAudioContexts(TMAPAPP_Context.AvailableSnkAudioContext,
                                                     TMAPAPP_Context.AvailableSrcAudioContext);
              if (status == BLE_STATUS_SUCCESS)
              {
                LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                             TMAPAPP_Context.AvailableSnkAudioContext,
                             TMAPAPP_Context.AvailableSrcAudioContext);
              }
              else
              {
                LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                             TMAPAPP_Context.AvailableSnkAudioContext,
                             TMAPAPP_Context.AvailableSrcAudioContext);
              }
              if (TMAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
              {
                uint8_t enable_solicitation_request = 0;
                if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
                {
                  enable_solicitation_request = 1;
                }
                TMAPAPP_StopAdvertising();
                /* Start Advertising */
                if (TMAPAPP_Context.CSIPRank > 0)
                {
                  status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_EARBUD);
                }
                else
                {
                  status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_HEADPHONES);
                }
                LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
              }
            }
            /* If no more ASEs are in Enabling/Streaming state, we could check if ASE associated to other CAP Initiator
             * are waiting for a response to an Enable Operation Request.
             */
            if (streaming_ongoing == 0u)
            {
              uint8_t enable_ongoing = 0u;
              /*check if a response to an Enable operation Request is suspended with another CAP Initiator*/
              for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
              {
                if ((TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&TMAPAPP_Context.ACL_Conn[conn] != p_conn))
                {
                  p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SNK_ASE > 0u)
                  for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
                  {
                    if (p_other_conn->pASEs->aSnkASE[i].allocated == 1)
                    {
                      if (p_other_conn->pASEs->aSnkASE[i].enable_req == 1)
                      {
                        enable_ongoing = 1u;
                        /* Send an response to the Enable Operation request if no CIS is still up*/
                        if (TMAPAPP_Context.num_cis_established == 0u)
                        {
                          status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                                           p_other_conn->pASEs->aSnkASE[i].ID,
                                                           ASE_OP_RESP_SUCCESS,
                                                           ASE_OP_RESP_NO_REASON);
                          if (status != BLE_STATUS_SUCCESS)
                          {
                            LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                         status,
                                         p_other_conn->pASEs->aSnkASE[i].ID,
                                         p_other_conn->Acl_Conn_Handle);
                          }
                          else
                          {
                            LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                         p_other_conn->pASEs->aSnkASE[i].ID,
                                         p_other_conn->Acl_Conn_Handle);
                          }
                        }
                      }
                    }
                  }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
                  for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
                  {
                    if (p_other_conn->pASEs->aSrcASE[i].allocated == 1)
                    {
                      if (p_other_conn->pASEs->aSrcASE[i].enable_req == 1)
                      {
                        enable_ongoing = 1u;
                        /* Send an response to the Enable Operation request if no CIS is still up*/
                        if (TMAPAPP_Context.num_cis_established == 0u)
                        {
                          status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                        p_other_conn->pASEs->aSrcASE[i].ID,
                                        ASE_OP_RESP_SUCCESS,
                                        ASE_OP_RESP_NO_REASON);
                          if (status != BLE_STATUS_SUCCESS)
                          {
                            LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                         status,
                                         p_other_conn->pASEs->aSrcASE[i].ID,
                                         p_other_conn->Acl_Conn_Handle);
                          }
                          else
                          {
                            LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                         p_other_conn->pASEs->aSrcASE[i].ID,
                                         p_other_conn->Acl_Conn_Handle);
                          }
                        }
                      }
                    }
                  }
#endif /* (APP_NUM_SRC_ASE > 0u) */
                }
              }
              /* Check if no response to an Enable Request is in progress to update Audio Contexts availability to
              * the connected CAP Initiators.
              */
              if (enable_ongoing == 0u)
              {
                for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
                {
                  if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
                  {
                    p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
                    if ((p_other_conn->AvailableSnkAudioContext != TMAPAPP_Context.AvailableSnkAudioContext) \
                        || (p_other_conn->AvailableSrcAudioContext != TMAPAPP_Context.AvailableSrcAudioContext))
                    {
                      /*update the available Audio Contexts of the all the connected CAP Initiators*/
                      status = CAP_UpdateAvailableAudioContexts(p_other_conn->Acl_Conn_Handle,
                                                                TMAPAPP_Context.AvailableSnkAudioContext,
                                                                TMAPAPP_Context.AvailableSrcAudioContext);
                      LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                                   TMAPAPP_Context.AvailableSnkAudioContext,
                                   TMAPAPP_Context.AvailableSrcAudioContext,
                                   p_other_conn->Acl_Conn_Handle,
                                   status);
                      p_other_conn->AvailableSnkAudioContext = TMAPAPP_Context.AvailableSnkAudioContext;
                      p_other_conn->AvailableSrcAudioContext = TMAPAPP_Context.AvailableSrcAudioContext;
                      UNUSED(status);
                    }
                    else
                    {
                      LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                                   TMAPAPP_Context.AvailableSnkAudioContext,
                                   TMAPAPP_Context.AvailableSrcAudioContext,
                                   p_other_conn->Acl_Conn_Handle);
                    }
                  }
                }
              }
            }
          }
          else
          {
            /*update the ASE state*/
            p_ase->state = p_info->State;
          }

          if ((p_info->State == ASE_STATE_ENABLING) || (p_info->State == ASE_STATE_STREAMING))
          {
            /*Parse the Metadata*/
            APP_ParseMetadataParams(p_ase,
                                    pNotification->ConnHandle,
                                    p_info->p.pEnStrDisConf->pMetadata,
                                    p_info->p.pEnStrDisConf->MetadataLength);
          }
        }
      }
      break;
    }
    case CAP_UNICAST_ASE_METADATA_UPDATED_EVT:
    {
      BAP_ASE_State_Params_t *p_info = (BAP_ASE_State_Params_t *)pNotification->pInfo;
      APP_ASE_Info_t *p_ase = 0;
      APP_ACL_Conn_t *p_conn = 0;
      LOG_INFO_APP("Metadata of ASE ID %d with remote CAP device on ConnHandle 0x%04X is updated\n",
                  p_info->ASE_ID,
                  pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        p_ase = APP_GetASE(p_info->ASE_ID,pNotification->ConnHandle);
        if (p_ase != 0)
        {
          if ((p_info->State == ASE_STATE_ENABLING) || (p_info->State == ASE_STATE_STREAMING))
          {
            /*Parse the Metadata*/
            APP_ParseMetadataParams(p_ase,
                                    pNotification->ConnHandle,
                                    p_info->p.pEnStrDisConf->pMetadata,
                                    p_info->p.pEnStrDisConf->MetadataLength);
          }
        }
      }
      break;
    }

