Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
        if (info->CIS_ConnHandle != 0xFFFF)
        {
          for (i = 0; i< APP_MAX_NUM_CIS; i++)
          {
            if (TMAPAPP_Context.cis_snk_handle[i] == info->CIS_ConnHandle)
            {
              TMAPAPP_Context.cis_snk_handle[i] = 0xFFFFu;
              TMAPAPP_Context.num_cis_snk--;
              break;
            }
          }
        }
        if (TMAPAPP_Context.num_cis_snk == 0u)
        {
          LOG_INFO_APP("No more Output Audio Data Path is up\n");
          TMAPAPP_Context.audio_role_setup &= ~AUDIO_ROLE_SINK;
          LOG_INFO_APP("Stop Tx Audio Peripheral Driver\n");
          Stop_TxAudio();
        }
      }
      break;
    }

    case CAP_CCP_META_EVT:
    {
      CCP_Notification_Evt_t *p_ccp_evt = (CCP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Call Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_ccp_evt->EvtOpcode,
                  p_ccp_evt->ConnHandle);
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)
      CCP_MetaEvt_Notification(p_ccp_evt);
#endif /*(APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
      break;
    }
    case CAP_MCP_META_EVT:
    {
      MCP_Notification_Evt_t *p_mcp_evt = (MCP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Media Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_mcp_evt->EvtOpcode,
                  p_mcp_evt->ConnHandle);
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)
      MCP_MetaEvt_Notification(p_mcp_evt);
#endif /*(APP_MCP_ROLE_CLIENT_SUPPORT == 1u)*/
      break;
    }
    case CAP_VCP_META_EVT:
    {
      VCP_Notification_Evt_t *p_vcp_evt = (VCP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Volume Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_vcp_evt->EvtOpcode,
                  p_vcp_evt->ConnHandle);
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
      VCP_MetaEvt_Notification(p_vcp_evt);
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
      break;
    }

    case CAP_MCP_LINKUP_EVT:
    {
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("Media Control Profile is linked on ConnHandle 0x%04X\n",pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if ((p_conn != 0) && (pNotification->Status == BLE_STATUS_SUCCESS))
      {
        p_conn->AudioProfile |= AUDIO_PROFILE_MCP;
      }
    }
    break;

    case CAP_MCP_INST_ACTIVATED_EVT:
    {
      CAP_MCP_InstInfo_Evt_t *mp_info = (CAP_MCP_InstInfo_Evt_t *)pNotification->pInfo;
      tBleStatus ret;
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("Media Player Instance with CCID %d is active to control Audio Stream with remote TMAP Device (ConnHandle 0x%04X)\n",
                  mp_info->ContentControlID,
                  pNotification->ConnHandle);
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_PLAYBACK_SPEED)
      {
        LOG_INFO_APP("Playback Speed feature is supported on remote TMAP Device\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_SEEKING_SPEED)
      {
        LOG_INFO_APP("Seeking Speed feature is supported on remote TMAP Device\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_PLAYING_ORDER)
      {
        LOG_INFO_APP("Playing Order feature is supported on remote TMAP Device\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_PLAYING_ORDERS_SUPPORTED)
      {
        LOG_INFO_APP("Supported Playing Orders feature is supported on remote TMAP Device\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_MEDIA_CTRL_OP)
      {
        LOG_INFO_APP("Media Control Operation feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_MEDIA_PLAYER_NAME)
      {
        LOG_INFO_APP("Media Player Name update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_TRACK_TITLE)
      {
        LOG_INFO_APP("Track Title update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_TRACK_DURATION)
      {
        LOG_INFO_APP("Track Duration update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_TRACK_POSITION)
      {
        LOG_INFO_APP("Track Position update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_PLAYBACK_SPEED)
      {
        LOG_INFO_APP("Playback Speed update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_SEEKING_SPEED)
      {
        LOG_INFO_APP("Seeking Speed update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_PLAYING_ORDER)
      {
        LOG_INFO_APP("Playing Order update Notification feature is supported on remote TMAP Device\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_MEDIA_CTRL_OP_SUPPORTED)
      {
        LOG_INFO_APP("Supported Media Control Operation update Notification feature is supported on remote TMAP Device\n");
      }
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      ret = MCP_CLIENT_ConfigureTrackTitleNotification(pNotification->ConnHandle,(mp_info->ContentControlID), 0x01u);
      if (ret != BLE_STATUS_SUCCESS)
      {
        if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
        {
          p_conn->PendingContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
        }
        LOG_INFO_APP("  Fail   : MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                     pNotification->ConnHandle,
                     mp_info->ContentControlID,
                     ret);
      }
      else
      {
        if (p_conn != 0)
        {
          p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
        }
        LOG_INFO_APP("  Success: MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d\n",
                     pNotification->ConnHandle,
                     mp_info->ContentControlID);
      }
    break;
    }

