Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case CAP_MCP_INST_DEACTIVATED_EVT:
    {
      uint8_t *ccid = (uint8_t *)pNotification->pInfo;
      LOG_INFO_APP("Media Player Instance with CCID %d is no more associated to Audio Stream with remote TMAP Device (connection handle 0x%04X)\n",
                  *ccid,
                  pNotification->ConnHandle);
      UNUSED(ccid);
    }
    break;

    case CAP_CCP_LINKUP_EVT:
    {
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("Call Control Profile is linked on ConnHandle 0x%04X\n",pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if ((p_conn != 0) && (pNotification->Status == BLE_STATUS_SUCCESS))
      {
        p_conn->AudioProfile |= AUDIO_PROFILE_CCP;
      }
    }
    break;

    case CAP_CCP_INST_ACTIVATED_EVT:
    {
      CAP_CCP_InstInfo_Evt_t *info = (CAP_CCP_InstInfo_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Telephone Bearer Instance with CCID %d is active to control Audio Stream with remote TMAP Device (connHandle 0x%04X)\n",
                  info->ContentControlID,
                  pNotification->ConnHandle);
      if (info->FeaturesMask & CCP_FEATURE_BEARER_SIGNAL_STRENGTH)
      {
        LOG_INFO_APP("Bearer Signal Strength ( and associated Signal Strength Reporting Interval) is supported on remote TMAP Device\n");
      }
      if (info->FeaturesMask & CCP_FEATURE_INC_CALL_TARGET_BEARER_URI)
      {
        LOG_INFO_APP("Incoming Call Target Bearer URI is supported on remote TMAP Device\n");
      }
      if (info->FeaturesMask & CCP_FEATURE_CALL_FRIENDLY_NAME)
      {
        LOG_INFO_APP("Call friendly Name is supported on remote TMAP Device\n");
      }
    }
    break;

    case CAP_CCP_INST_DEACTIVATED_EVT:
    {
      uint8_t *ccid = (uint8_t *)pNotification->pInfo;
      LOG_INFO_APP("Telephone Bearer Instance with CCID %d is no more associated to Audio Stream with remote TMAP Device (connection handle 0x%04X)\n",
                  *ccid,
                  pNotification->ConnHandle);
      UNUSED(ccid);
    }
    break;
    default:
      break;
  }
}
static void LinkupRetry_TimerCallback(void *arg)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_APP_LINKUP_RETRY_TIMER_ID, CFG_SEQ_PRIO_0);
}
static void APP_LinkupTaskHandler(void)
{
  tBleStatus status;
  LOG_INFO_APP("Retry to perform Linkup with a remote connected device\n");
  for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if ( TMAPAPP_Context.ACL_Conn[conn].LinkupRetry == 1u)
    {
      /*Update LinkupRetry flag to indicate that Linkup retry has been handled*/
      TMAPAPP_Context.ACL_Conn[conn].LinkupRetry = 0xFFu;
      status = TMAPAPP_Linkup(TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
      if (status == BLE_STATUS_SUCCESS)
      {
        return;
      }
    }
  }
}

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
static uint8_t APP_BroadcastSetupAudio(Audio_Role_t role)
{
  Sampling_Freq_t sampling_freq;
  Frame_Duration_t frame_duration;
  uint8_t direction = DATA_PATH_INPUT;
  uint32_t controller_delay;
  uint32_t controller_delay_min = 0;
  uint32_t controller_delay_max = 0;
  uint8_t a_codec_id[5] = {0x00,0x00,0x00,0x00,0x00};
  tBleStatus ret;

  LOG_INFO_APP("==>> Start APP_BroadcastSetupAudio function\n");

  a_codec_id[0] = AUDIO_CODING_FORMAT_LC3;

  sampling_freq = LTV_GetConfiguredSamplingFrequency(
      &TMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
      TMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

  frame_duration = LTV_GetConfiguredFrameDuration(
      &TMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
      TMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

  if ((sampling_freq != 0) && (frame_duration != 0xFF))
  {
    APP_StartBroadcastAudio(role);
    MX_AudioInit(role,
                 sampling_freq,
                 frame_duration,
                 (uint8_t *)aSnkBuff,
                 NULL);

    /* AUDIO_ROLE_SINK */
    direction = DATA_PATH_OUTPUT;
    CAP_Broadcast_ReadSupportedControllerDelay(TMAPAPP_Context.BSNK.current_num_bis,
                                               DATA_PATH_OUTPUT,
                                               a_codec_id,
                                               &controller_delay_min,
                                               &controller_delay_max);

    /* choice of implementation : we try to use as much as possible the controller RAM for delaying before the application RAM*/
    controller_delay = TMAPAPP_Context.BSNK.base_group.PresentationDelay - APP_DELAY_SNK_MIN;

    /* check that we don't exceed the maximum value */
    if (controller_delay > controller_delay_max)
    {
      controller_delay = controller_delay_max;
      LOG_INFO_APP("Controller delay clipped to maximum value %d us\n", controller_delay);
    }
    else if (controller_delay < controller_delay_min)
    {
      controller_delay = controller_delay_min;
      LOG_INFO_APP("Controller delay clipped to minimum value %d us\n", controller_delay);
      LOG_INFO_APP("Warning, could not respect the presentation delay (too low)\n");
    }
    else
    {
      LOG_INFO_APP("Controller delay chosen to %d us\n", controller_delay);
    }

    /* compute the application delay */
    LOG_INFO_APP("Expecting application to respect the delay of %d us\n",
                (TMAPAPP_Context.BSNK.base_group.PresentationDelay - controller_delay));
    if ((TMAPAPP_Context.BSNK.base_group.PresentationDelay - controller_delay) > APP_DELAY_SNK_MAX)
    {
      LOG_INFO_APP("Warning, could not respect the presentation delay (too high)\n");
    }

    CODEC_DataPathSampleParam_t param;
    /* sample coded on 16bits */
    param.SampleDepth = 16;

    /* SAI/I2C peripheral driver requests to set decimation to 2 (stereo buffer)*/
    param.Decimation = 2;

    ret = CAP_Broadcast_SetupAudioDataPath(TMAPAPP_Context.BSNK.current_num_bis,
                                            &TMAPAPP_Context.BSNK.current_BIS_conn_handles[0],
                                            direction,
                                            a_codec_id,
                                            controller_delay,
                                            DATA_PATH_SAMPLE_CIRC_BUF,
                                            CONFIGURE_DATA_PATH_SAMPLE_LEN,
                                            (const uint8_t*) &param);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_SetupAudioDataPath() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_SetupAudioDataPath() function\n");
    }
  }
  else
  {
    LOG_INFO_APP("Sampling Frequency in LTV is invalid\n");
    ret = BLE_STATUS_FAILED;
  }
  LOG_INFO_APP("==>> End APP_BroadcastSetupAudio function\n");
  return ret;
}

static uint8_t APP_StartBroadcastAudio(Audio_Role_t role)
{
  if(role == AUDIO_ROLE_SOURCE)
  {
    CODEC_RegisterTriggerClbk(DATA_PATH_SAMPLE_CIRC_BUF, DATA_PATH_INPUT, &start_audio_source);
  }
  else if (role == AUDIO_ROLE_SINK)
  {
    CODEC_RegisterTriggerClbk(DATA_PATH_SAMPLE_CIRC_BUF, DATA_PATH_OUTPUT, &start_audio_sink);
  }
  return 0;
}
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/

static uint8_t TMAPAPP_BuildAdvDataPacket(uint8_t *pAdvData,
                                         uint8_t *AdvPacketLen,
                                         CAP_Announcement_t AnnouncementType,
                                         uint8_t EnableSolicitationRequest,
                                         uint16_t Appearance)
{
  *AdvPacketLen = TMAP_BuildAdvPacket(AnnouncementType,
                                      (void*)0u,
                                      0u,
                                      Appearance,
                                      &pAdvData[0],
                                      (CAP_ADV_DATA_LEN+TMAP_USR_ADV_DATA_LEN));

  if (EnableSolicitationRequest == 1)
  {
    *AdvPacketLen += CAP_Broadcast_BuildSolicitationRequestAdvPacket(&pAdvData[*AdvPacketLen],
                                                                     CAP_ADV_DATA_LEN+TMAP_USR_ADV_DATA_LEN-*AdvPacketLen);
  }

  if (*AdvPacketLen > 0u)
  {
    uint8_t i;
    LOG_INFO_APP("CAP Advertising Packet (Length : %d) :\n",(*AdvPacketLen));
    for (i = 0u; i < (*AdvPacketLen) ; i++)
    {
      LOG_INFO_APP("0x%02X ",pAdvData[i]);
    }
    LOG_INFO_APP("\n");
    return BLE_STATUS_SUCCESS;
  }
  else
  {
    LOG_INFO_APP("Error to build Advertising Packet by CAP\n");
    return BLE_STATUS_ERROR;
  }
}

