Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
static void APP_ParseMetadataParams(APP_ASE_Info_t *pASE,
                                    uint16_t ConnHandle,
                                    uint8_t const *pMetadata,
                                    uint8_t MetadataLength)
{
  uint8_t status;
  Audio_Context_t audio_context = 0x0000;
  Audio_Context_t snk_context = 0x0000;
  Audio_Context_t src_context = 0x0000;
  Audio_Context_t available_snk_context = 0x0000;
  Audio_Context_t available_src_context = 0x0000;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  LOG_INFO_APP("Parse Metadata of ASE ID 0x%02X (Type 0x%02X) in state 0x%02X on ConnHandle 0x%04X\n",
               pASE->ID,
               pASE->type,
               pASE->state,
               ConnHandle);
  if (p_conn != 0)
  {
    status = LTV_GetStreamingAudioContexts((uint8_t *)pMetadata,MetadataLength,&audio_context);
    if(status == 1u)
    {
      LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X is associated to a Streaming Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   audio_context);
      /*update available audio contexts in case of streaming audio contexts associated to the ASE has changed*/
      if (pASE->streaming_audio_context != audio_context)
      {
        LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X was previously associated to a Streaming Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   pASE->streaming_audio_context);
        /* Release the Streaming Audio Contexts previously associated to the ASE to calculate resulting
         * new available audio contexts in compliance with other ASEs in ENABLING or STREAMING state
         */
        if (pASE->type == ASE_SINK)
        {
          if ( pASE->streaming_audio_context != 0x0000u)
          {
            snk_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                pASE,
                                                                pASE->streaming_audio_context);
          }
        }
        else
        {
          if ( pASE->streaming_audio_context != 0x0000u)
          {
            src_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                pASE,
                                                                pASE->streaming_audio_context);
          }
        }
        /* if context are now available, update them */
        available_snk_context = TMAPAPP_Context.AvailableSnkAudioContext | snk_context;
        available_src_context = TMAPAPP_Context.AvailableSrcAudioContext | src_context;

        /* now it's time to update the available audio contexts according to the new streaming audio context
         * of the specified ASE
         */
        pASE->streaming_audio_context = audio_context;

        /* Set audio contexts to removed from availability according to the streaming audio contexts associated to the
         * ASE.
         */
        if (pASE->type == ASE_SINK)
        {
          /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
          available_snk_context = APP_UnavailableAudioContexts(pASE->type,available_snk_context,audio_context);
        }
        else /*(p_info->type & ASE_SOURCE)*/
        {
          /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
          available_src_context = APP_UnavailableAudioContexts(ASE_SOURCE,available_src_context,audio_context);
        }
        LOG_INFO_APP("Previous Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                     TMAPAPP_Context.AvailableSnkAudioContext,
                     TMAPAPP_Context.AvailableSrcAudioContext);
        LOG_INFO_APP("Calculated New Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                     available_snk_context,
                     available_src_context);

        /*Set new available audio contexts for BAP Announcement*/
        status = CAP_SetAvailableAudioContexts(available_snk_context,available_src_context);
        if (status == BLE_STATUS_SUCCESS)
        {
          if (pASE->type == ASE_SINK)
          {
            TMAPAPP_Context.AvailableSnkAudioContext = available_snk_context;
          }
          else /*(p_info->type & ASE_SOURCE)*/
          {
            TMAPAPP_Context.AvailableSrcAudioContext = available_src_context;
          }
          LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                       TMAPAPP_Context.AvailableSnkAudioContext,
                       TMAPAPP_Context.AvailableSrcAudioContext);
        }
        else
        {
          LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                       available_snk_context,
                       available_src_context);
        }

        if (TMAPAPP_Context.NumConn > 1u )
        {
          if ((p_conn->AvailableSnkAudioContext != SUPPORTED_SNK_CONTEXTS) \
              || (p_conn->AvailableSrcAudioContext != SUPPORTED_SRC_CONTEXTS))
          {
            /*update the available Audio Contexts of the CAP Initiator requesting the enable operation*/
            status = CAP_UpdateAvailableAudioContexts(ConnHandle,
                                                      SUPPORTED_SNK_CONTEXTS,
                                                      SUPPORTED_SRC_CONTEXTS);
            LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         ConnHandle,
                         status);
            p_conn->AvailableSnkAudioContext = SUPPORTED_SNK_CONTEXTS;
            p_conn->AvailableSrcAudioContext = SUPPORTED_SRC_CONTEXTS;
          }
          else
          {
            LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         ConnHandle);
          }

          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if ((TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&TMAPAPP_Context.ACL_Conn[conn] != p_conn))
            {
              if ((TMAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext != TMAPAPP_Context.AvailableSnkAudioContext) \
                  || (TMAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext != TMAPAPP_Context.AvailableSrcAudioContext))
              {
                /* we update the Audio Contexts availability to other connected CAP Initiators */
                status = CAP_UpdateAvailableAudioContexts(TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                                                          TMAPAPP_Context.AvailableSnkAudioContext,
                                                          TMAPAPP_Context.AvailableSrcAudioContext);
                LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                             TMAPAPP_Context.AvailableSnkAudioContext,
                             TMAPAPP_Context.AvailableSrcAudioContext,
                             TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                             status);
                TMAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext = TMAPAPP_Context.AvailableSnkAudioContext;
                TMAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext = TMAPAPP_Context.AvailableSrcAudioContext;
              }
              else
              {
                LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                             TMAPAPP_Context.AvailableSnkAudioContext,
                             TMAPAPP_Context.AvailableSrcAudioContext,
                             TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
              }
            }
          }
        }
        if (TMAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
        {
          uint8_t enable_solicitation_request = 0;
          if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
          {
            enable_solicitation_request = 1;
          }
          TMAPAPP_StopAdvertising();
          /* Start Advertising */
          if (TMAPAPP_Context.CSIPRank > 0)
          {
            status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_EARBUD);
          }
          else
          {
            status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_HEADPHONES);
          }
          LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
        }
      }
    }

