Erlond92/Test_BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    /* SAI/I2C peripheral driver requests to set decimation to 2*/

    if (role == AUDIO_ROLE_SOURCE)
    {
      param.Decimation = 1;
    }
    else
    {
      param.Decimation = 2;
    }

    /*Data Path ID is vendor-specific transport interface : 0x01 for "Shared memory of SAI"*/
    status = CAP_Unicast_SetupAudioDataPath(CIS_ConnHandle,
                                            ASE_ID,
                                            DATA_PATH_SAMPLE_CIRC_BUF,
                                            ControllerDelay,
                                            CONFIGURE_DATA_PATH_SAMPLE_LEN,
                                            (uint8_t *)&param);
    LOG_INFO_APP("Setup Unicast Audio Data Path for ASE ID %d on CIS connection handle 0x%04X with controller delay at %d us returns status 0x%02X\n",
                ASE_ID,
                CIS_ConnHandle,
                ControllerDelay,
                status);
    if(status != BLE_STATUS_SUCCESS)
    {
      /*remove cis_handle*/
      if (role == AUDIO_ROLE_SOURCE)
      {
        for (i = 0; i< APP_MAX_NUM_CIS; i++)
        {
          if (TMAPAPP_Context.cis_src_handle[i] == CIS_ConnHandle)
          {
            TMAPAPP_Context.cis_src_handle[i] = 0xFFFFu;
            TMAPAPP_Context.num_cis_src--;
            break;
          }
        }
      }
      else if (role == AUDIO_ROLE_SINK)
      {
        for (i = 0; i< APP_MAX_NUM_CIS; i++)
        {
          if (TMAPAPP_Context.cis_snk_handle[i] == CIS_ConnHandle)
          {
            TMAPAPP_Context.cis_snk_handle[i] = 0xFFFFu;
            TMAPAPP_Context.num_cis_snk--;
            break;
          }
        }
      }
    }
    else
    {
      APP_ASE_Info_t *p_app_ase;
      p_app_ase = APP_GetASE(ASE_ID,ACL_ConnHandle);
      if (p_app_ase != 0)
      {
        LOG_INFO_APP("Audio Data Path is complete with remaining Application delay for audio process to respect : %dus\n",
                     (p_app_ase->presentation_delay - p_app_ase->controller_delay));
      }
    }
  }
  else
  {
    LOG_INFO_APP("No Audio Stream Endpoint with ASE ID %d on ACL connection handle 0x%04X status 0x%02X\n",
                 ASE_ID,
                 ACL_ConnHandle);
    status = BLE_STATUS_INVALID_PARAMS;
  }
  UNUSED(num_chnls);
  return status;
}

static uint8_t APP_GetBitsAudioChnlAllocations(Audio_Chnl_Allocation_t ChnlLocations)
{

  uint8_t bits = 0u;
  uint8_t i;

  for (i = 0; i < (8u*sizeof(Audio_Chnl_Allocation_t)); i++)
  {
    if (ChnlLocations & (1u<<i))
    {
      bits++;
    }
  }
  return bits;
}

/*Audio Source */
static int32_t start_audio_source(void)
{
  return Start_RxAudio();
}

/*Audio Sink */
static int32_t start_audio_sink(void)
{
  /* reset numbers of active channels */
  Nb_Active_Ch = 0;

  return Start_TxAudio();
}

static char Hex_To_Char(uint8_t Hex)
{
  if (Hex < 0xA)
  {
    return (char) Hex + 48;
  }
  else
  {
    return (char) Hex + 55;
  }
}

/* Добавьте эту функцию в файл, где есть доступ к TMAPAPP_Context */
void Send_Audio_To_Bluetooth(int32_t *audio_buffer_ptr)
{
  uint8_t i;

  /* --- НАЧАЛО БЛОКА ОТЛАДКИ --- */
  /* Статическая переменная сохраняет свое значение между вызовами функции */
  static uint16_t debug_counter = 0;

  debug_counter++;
  if (debug_counter >= 100) // Если фрейм 10 мс, то 100 фреймов = 1 секунда
  {
    debug_counter = 0; // Сбрасываем счетчик

    /* Выводим первые 4 сэмпла в десятичном виде (%ld для int32_t),
       чтобы видеть реальную амплитуду звуковой волны */
    LOG_INFO_APP("Mic: %ld | %ld | %ld | %ld\n",
                 audio_buffer_ptr[0],
                 audio_buffer_ptr[1],
                 audio_buffer_ptr[2],
                 audio_buffer_ptr[3]);
  }
  /* Проходим по всем возможным подключениям (наушникам) */
  for (i = 0; i < APP_MAX_NUM_CIS; i++)
  {
    /* Если соединение установлено */
    if (TMAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(TMAPAPP_Context.cis_src_handle[i], 1, audio_buffer_ptr);
    }
  }
}